CSI API ETABS v1

# cDesignConcreteGetRebarPrefsColumn Method

---

Retrieves data from the Rebar Selection Rules for Columns

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetRebarPrefsColumn(
    	int Item,
    	ref string Value
    )

    Function GetRebarPrefsColumn (
    	Item As Integer,
    	ByRef Value As String
    ) As Integer

    Dim instance As cDesignConcrete
    Dim Item As Integer
    Dim Value As String
    Dim returnValue As Integer

    returnValue = instance.GetRebarPrefsColumn(Item,
    	Value)

    int GetRebarPrefsColumn(
    	int Item,
    	String^% Value
    )

    abstract GetRebarPrefsColumn :
            Item : int *
            Value : string byref -> int

#### Parameters

Item

    Type: SystemInt32
An integer value corresponding to the data to be retrieved, from the following
list

  1. Non-Seismic Smallest Longitudinal Bar Size
  2. Non-Seismic Largest Longitudinal Bar Size
  3. Non-Seismic Smallest Tie Bar Size
  4. Non-Seismic Largest Tie Bar Size
  5. Non-Seismic Min Spacing
  6. Non-Seismic Max Spacing
  7. Seismic Smallest Longitudinal Bar Size
  8. Seismic Largest Longitudinal Bar Size
  9. Seismic Smallest Tie Bar Size
  10. Seismic Largest Tie Bar Size
  11. Seismic Min Spacing
  12. Seismic Max Spacing

Value

    Type: SystemString
The retrieved data; note that numerical values are converted to String

#### Return Value

Type: Int32
Returns zero if the data is successfully retrieved; otherwise returns non-zero

Remarks

Examples

VB

Copy

    Public Sub Example()
           Dim SapModel As cSapModel
           Dim EtabsObject As cOAPI
           Dim ret As Integer = -1
           Dim Value as String

       'create ETABS object
           Dim myHelper as cHelper = New Helper
           EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")

       'start ETABS application
           ret = EtabsObject.ApplicationStart()

       'create SapModel object
           SapModel = EtabsObject.SapModel

       'initialize model
           ret = SapModel.InitializeNewModel()

       'create steel deck template model
           ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)

       'retrieve rebar data
           ret = SapModel.File.GetRebarPrefsColumn(3, Value)

       'close ETABS
           EtabsObject.ApplicationExit(False)

       'clean up variables
           SapModel = Nothing
           EtabsObject = Nothing
       End Sub

See Also

#### Reference

cDesignConcrete Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com